export const surveyQuestions = [
    {
        question: 'Призначення автомобіля?',
        key: 'purpose',
        weight: 1.2,
        options: ['Вантажні перевезення', 'Для міста', 'Для подорожей'],
    },
    {
        question: 'Рівень потужності двигуна автомобіля?',
        key: 'power',
        weight: 1.2,
        options: ['Слабкий', 'Нормальний', 'Сильний'],
    },
    {
        question: 'Яке споживання автомобіля?',
        key: 'consumption',
        weight: 1.5,
        options: ['Економний автомобіль', 'Середній автомобіль', 'Неекономний автомобіль'],
    },
    {
        question: 'Рейтинг краш-тесту автомобіля (1 небезпечний, 5 безпечний)?',
        key: 'safety',
        weight: 1.5,
        options: ['3', '4', '5'],
    },
    {
        question: 'Які габарити автомобіля бажаєте?',
        key: 'size',
        weight: 1.1,
        options: ['Компактний', 'Звичайний', 'Великий'],
    },
    {
        question: 'Яка потрібна кількість крісел?',
        key: 'seats',
        weight: 1.2,
        options: ['2', '4', '5', '8'],
    },
    {
        question: 'Чи потрібен великий багажник?',
        key: 'trunk',
        weight: 0.8,
        options: ['Так', 'Ні'],
    },
    {
        question: 'Який рівень комфорту автомобіля?',
        key: 'comfort',
        weight: 1.3,
        options: ['Середній', 'Високий'],
    },
];